stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_timer.c
/*!**************************************************************************
    @file stm32f1x3_timer.c
    @brief Source file for stm32f103 TIMER
    @author Stuart Ianna
    @version 1.0
    @date June 2018
    @copyright GNU GPLv3
    @warning None
    @bug 

    @details

    @par Verified Compilers
    - arm-none-eabi-gcc (15:4.9.3+svn231177-1) 4.9.3 20150529 (prerelease)
******************************************************************************/
#include "stm32f1x3_timer.h"

typedef enum{

    T1C1_STAT = 0x1,
    T1C2_STAT = 0x2,
    T1C3_STAT = 0x4,
    T1C4_STAT = 0x8,

    T2C1_STAT = 0x1,
    T2C2_STAT = 0x2,
    T2C3_STAT = 0x4,
    T2C4_STAT = 0x8,

    T3C1_STAT = 0x1,
    T3C2_STAT = 0x2,
    T3C3_STAT = 0x4,
    T3C4_STAT = 0x8,

    T4C1_STAT = 0x1,
    T4C2_STAT = 0x2,
    T4C3_STAT = 0x4,
    T4C4_STAT = 0x8,

}timer_capture;

/****************************************************************************/
//				                TIMER1
/****************************************************************************/

static mcu_error timer1_setupPWM(timer_channel timerChannel, uint32_t frequency, uint8_t duty);
static mcu_error timer1_setupPulse(timer_channel timerChannel,uint32_t frequency,uint32_t pulse);
static mcu_error timer1_setupIC(timer_channel timerChannel);

static void timer1_input_capture(void);
static void (*tim1_up_handler)(void);
static void (*tim1_cc_handler)(void);

//This is all used with input capture
static volatile uint8_t t1_status;
static volatile uint16_t t1c1_rise;
static volatile uint16_t t1c2_rise;
static volatile uint16_t t1c3_rise;
static volatile uint16_t t1c4_rise;
static volatile uint16_t t1c1_cap;
static volatile uint16_t t1c2_cap;
static volatile uint16_t t1c3_cap;
static volatile uint16_t t1c4_cap;

/****************************************************************************/
//				                TIMER2
/****************************************************************************/

static mcu_error timer2_setupPWM(timer_channel timerChannel, uint32_t frequency, uint8_t duty);
static mcu_error timer2_setupPulse(timer_channel timerChannel,uint32_t frequency,uint32_t pulse);
static mcu_error timer2_setupIC(timer_channel timerChannel);

static void timer2_input_capture(void);
static void (*tim2_up_handler)(void);

//This is all used with input capture
static volatile uint8_t t2_stat_reg;
static volatile uint8_t t2_status;
static volatile uint16_t t2c1_rise;
static volatile uint16_t t2c2_rise;
static volatile uint16_t t2c3_rise;
static volatile uint16_t t2c4_rise;
static volatile uint16_t t2c1_cap;
static volatile uint16_t t2c2_cap;
static volatile uint16_t t2c3_cap;
static volatile uint16_t t2c4_cap;

/****************************************************************************/
//				                TIMER3
/****************************************************************************/

static mcu_error timer3_setupPWM(timer_channel timerChannel, uint32_t frequency, uint8_t duty);
static mcu_error timer3_setupPulse(timer_channel timerChannel,uint32_t frequency,uint32_t pulse);
static mcu_error timer3_setupIC(timer_channel timerChannel);

static void timer3_input_capture(void);
static void (*tim3_up_handler)(void);

//This is all used with input capture
static volatile uint8_t t3_status;
static volatile uint16_t t3c1_rise;
static volatile uint16_t t3c2_rise;
static volatile uint16_t t3c3_rise;
static volatile uint16_t t3c4_rise;
static volatile uint16_t t3c1_cap;
static volatile uint16_t t3c2_cap;
static volatile uint16_t t3c3_cap;
static volatile uint16_t t3c4_cap;

/****************************************************************************/
//				                TIMER4
/****************************************************************************/

static mcu_error timer4_setupPWM(timer_channel timerChannel, uint32_t frequency, uint8_t duty);
static mcu_error timer4_setupPulse(timer_channel timerChannel,uint32_t frequency,uint32_t pulse);
static mcu_error timer4_setupIC(timer_channel timerChannel);

static void timer4_input_capture(void);
static void (*tim4_up_handler)(void);

//This is all used with input capture
static volatile uint8_t t4_status;
static volatile uint16_t t4c1_rise;
static volatile uint16_t t4c2_rise;
static volatile uint16_t t4c3_rise;
static volatile uint16_t t4c4_rise;
static volatile uint16_t t4c1_cap;
static volatile uint16_t t4c2_cap;
static volatile uint16_t t4c3_cap;
static volatile uint16_t t4c4_cap;

/****************************************************************************/
//			                    IRQ
/****************************************************************************/

static void timer1_input_capture(void){

    if((TIM_SR(TIM1) & TIM_SR_UIF)){

        //This checks if a whole period has passed with no capture event for each channel
        //Probably a better way to do this

        if(!(t1_status & T1C1_STAT)){

            t1c1_cap = 0;
        }
        if(!(t1_status & T1C2_STAT)){

            t1c2_cap = 0;
        }
        if(!(t1_status & T1C3_STAT)){

            t1c3_cap = 0;
        }
        if(!(t1_status & T1C4_STAT)){

            t1c4_cap = 0;
        }

        t1_status = 0;
    }

    if((TIM_SR(TIM1) & TIM_SR_CC1IF)){

        //Falling edge detection
        if(TIM_CCER(TIM1) & TIM_CCER_CC1P){

            t1c1_cap = TIM_CCR1(TIM1) - t1c1_rise;

            //Set rising edge
            TIM_CCER(TIM1) &= ~TIM_CCER_CC1P;

            //Mark read instance
            t1_status |= T1C1_STAT;
        }
        //Rising edge detection
        else{

            //Get rise time
            t1c1_rise = TIM_CCR1(TIM1);     

            //Set falling edge
            TIM_CCER(TIM1) |= TIM_CCER_CC1P;

            //Mark read instance
            t1_status |= T1C1_STAT;
        }

    }
    if((TIM_SR(TIM1) & TIM_SR_CC2IF)){

        //Falling edge detection
        if(TIM_CCER(TIM1) & TIM_CCER_CC2P){

            //Record the time
            t1c2_cap = TIM_CCR2(TIM1) - t1c2_rise;

