stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_timer.c
            //Set rising edge
            TIM_CCER(TIM1) &= ~TIM_CCER_CC2P;

            //Mark read instance
            t1_status |= T1C2_STAT;
        }
        //Rising edge detection
        else{

            t1c2_rise = TIM_CCR2(TIM1); 

            //Set falling edge
            TIM_CCER(TIM1) |= TIM_CCER_CC2P;

            //Mark read instance
            t1_status |= T1C2_STAT;

        }
    }
    if((TIM_SR(TIM1) &TIM_SR_CC3IF)){

        //Falling edge detection
        if(TIM_CCER(TIM1) & TIM_CCER_CC3P){


            //Record the time
            t1c3_cap = TIM_CCR3(TIM1) - t1c3_rise;

            //Set rising edge
            TIM_CCER(TIM1) &= ~TIM_CCER_CC3P;

            //Mark read instance
            t1_status |= T1C3_STAT;
        }
        //Rising edge detection
        else{

            t1c3_rise = TIM_CCR3(TIM1); 

            //Set falling edge
            TIM_CCER(TIM1) |= TIM_CCER_CC3P;

            //Mark read instance
            t1_status |= T1C3_STAT;

        }
    }
    if((TIM_SR(TIM1) & TIM_SR_CC4IF)){

        //Falling edge detection
        if(TIM_CCER(TIM1) & TIM_CCER_CC4P){

            //Record the time
            t1c4_cap = TIM_CCR4(TIM1) - t1c4_rise;

            //Set rising edge
            TIM_CCER(TIM1) &= ~TIM_CCER_CC4P;

            //Mark read instance
            t1_status |= T1C4_STAT;
        }
        //Rising edge detection
        else{

            t1c4_rise = TIM_CCR4(TIM1); 

            //Set falling edge
            TIM_CCER(TIM1) |= TIM_CCER_CC4P;

            //Mark read instance
            t1_status |= T1C4_STAT;

        }

    }
}

static void timer2_input_capture(void){

    if(t2_stat_reg){

        //This checks if a whole period has passed with no capture event for each channel
        //Probably a better way to do this

        if(!(t2_status & T2C1_STAT)){

            t2c1_cap = 0;
        }
        if(!(t2_status & T2C2_STAT)){

            t2c2_cap = 0;
        }
        if(!(t2_status & T2C3_STAT)){

            t1c3_cap = 0;
        }
        if(!(t2_status & T2C4_STAT)){

            t2c4_cap = 0;
        }

        t2_status = 0;
    }

    if((TIM_SR(TIM2) & TIM_SR_CC1IF)){

        //Falling edge detection
        if(TIM_CCER(TIM2) & TIM_CCER_CC1P){

            t2c1_cap = TIM_CCR1(TIM2) - t2c1_rise;

            //Set rising edge
            TIM_CCER(TIM2) &= ~TIM_CCER_CC1P;

            //Mark read instance
            t2_status |= T2C1_STAT;
        }
        //Rising edge detection
        else{

            //Get rise time
            t2c1_rise = TIM_CCR1(TIM2);     

            //Set falling edge
            TIM_CCER(TIM2) |= TIM_CCER_CC1P;

            //Mark read instance
            t2_status |= T2C1_STAT;
        }

    }
    if((TIM_SR(TIM2) & TIM_SR_CC2IF)){

        //Falling edge detection
        if(TIM_CCER(TIM2) & TIM_CCER_CC2P){


            //Record the time
            t2c2_cap = TIM_CCR2(TIM2) - t2c2_rise;

            //Set rising edge
            TIM_CCER(TIM2) &= ~TIM_CCER_CC2P;

            //Mark read instance
            t2_status |= T2C2_STAT;
        }
        //Rising edge detection
        else{

            t2c2_rise = TIM_CCR2(TIM2); 

            //Set falling edge
            TIM_CCER(TIM2) |= TIM_CCER_CC2P;

            //Mark read instance
            t2_status |= T2C2_STAT;

        }
    }
    if((TIM_SR(TIM2) &TIM_SR_CC3IF)){

        //Falling edge detection
        if(TIM_CCER(TIM2) & TIM_CCER_CC3P){


            //Record the time
            t2c3_cap = TIM_CCR3(TIM2) - t2c3_rise;

            //Set rising edge
            TIM_CCER(TIM2) &= ~TIM_CCER_CC3P;

            //Mark read instance
            t2_status |= T2C3_STAT;
        }
        //Rising edge detection
        else{

            t2c3_rise = TIM_CCR3(TIM2); 

            //Set falling edge
            TIM_CCER(TIM2) |= TIM_CCER_CC3P;

            //Mark read instance
            t2_status |= T2C3_STAT;

        }
    }
    if((TIM_SR(TIM2) & TIM_SR_CC4IF)){

        //Falling edge detection
        if(TIM_CCER(TIM2) & TIM_CCER_CC4P){

            //Record the time
            t2c4_cap = TIM_CCR4(TIM2) - t2c4_rise;

            //Set rising edge
            TIM_CCER(TIM2) &= ~TIM_CCER_CC4P;

            //Mark read instance
            t2_status |= T2C4_STAT;
        }
        //Rising edge detection
        else{

            t2c4_rise = TIM_CCR4(TIM2); 

            //Set falling edge
            TIM_CCER(TIM2) |= TIM_CCER_CC4P;

            //Mark read instance
            t2_status |= T2C4_STAT;

        }

    }

}

static void timer3_input_capture(void){

    if((TIM_SR(TIM3) & TIM_SR_UIF)){

        //This checks if a whole period has passed with no capture event for each channel
        //Probably a better way to do this

        if(!(t3_status & T3C1_STAT)){

            t3c1_cap = 0;
        }
        if(!(t3_status & T3C2_STAT)){

            t3c2_cap = 0;
        }
        if(!(t3_status & T3C3_STAT)){

            t3c3_cap = 0;
        }
        if(!(t3_status & T3C4_STAT)){

            t3c4_cap = 0;
        }

        t3_status = 0;
    }

    if((TIM_SR(TIM3) & TIM_SR_CC1IF)){

        //Falling edge detection
        if(TIM_CCER(TIM3) & TIM_CCER_CC1P){

            t3c1_cap = TIM_CCR1(TIM3) - t3c1_rise;

            //Set rising edge
            TIM_CCER(TIM3) &= ~TIM_CCER_CC1P;

            //Mark read instance
            t3_status |= T3C1_STAT;
        }
        //Rising edge detection
        else{

            //Get rise time
            t3c1_rise = TIM_CCR1(TIM3);     

            //Set falling edge
            TIM_CCER(TIM3) |= TIM_CCER_CC1P;

            //Mark read instance
            t3_status |= T3C1_STAT;
        }

    }
    if((TIM_SR(TIM3) & TIM_SR_CC2IF)){

        //Falling edge detection
        if(TIM_CCER(TIM3) & TIM_CCER_CC2P){


            //Record the time
            t3c2_cap = TIM_CCR2(TIM3) - t3c2_rise;

            //Set rising edge
            TIM_CCER(TIM3) &= ~TIM_CCER_CC2P;

            //Mark read instance
            t3_status |= T3C2_STAT;
        }
        //Rising edge detection
        else{

            t3c2_rise = TIM_CCR2(TIM3); 

            //Set falling edge
            TIM_CCER(TIM3) |= TIM_CCER_CC2P;

            //Mark read instance
            t3_status |= T3C2_STAT;

