stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_timer.c
        }
    }
    if((TIM_SR(TIM3) &TIM_SR_CC3IF)){

        //Falling edge detection
        if(TIM_CCER(TIM3) & TIM_CCER_CC3P){


            //Record the time
            t3c3_cap = TIM_CCR3(TIM3) - t3c3_rise;

            //Set rising edge
            TIM_CCER(TIM3) &= ~TIM_CCER_CC3P;

            //Mark read instance
            t3_status |= T2C3_STAT;
        }
        //Rising edge detection
        else{

            t3c3_rise = TIM_CCR3(TIM3); 

            //Set falling edge
            TIM_CCER(TIM3) |= TIM_CCER_CC3P;

            //Mark read instance
            t3_status |= T3C3_STAT;

        }
    }
    if((TIM_SR(TIM3) & TIM_SR_CC4IF)){

        //Falling edge detection
        if(TIM_CCER(TIM3) & TIM_CCER_CC4P){

            //Record the time
            t3c4_cap = TIM_CCR4(TIM3) - t3c4_rise;

            //Set rising edge
            TIM_CCER(TIM3) &= ~TIM_CCER_CC4P;

            //Mark read instance
            t3_status |= T3C4_STAT;
        }
        //Rising edge detection
        else{

            t3c4_rise = TIM_CCR4(TIM3); 

            //Set falling edge
            TIM_CCER(TIM3) |= TIM_CCER_CC4P;

            //Mark read instance
            t3_status |= T3C4_STAT;

        }

    }
}

static void timer4_input_capture(void){

    if((TIM_SR(TIM4) & TIM_SR_UIF)){

        //This checks if a whole period has passed with no capture event for each channel
        //Probably a better way to do this

        if(!(t4_status & T4C1_STAT)){

            t4c1_cap = 0;
        }
        if(!(t4_status & T4C2_STAT)){

            t4c2_cap = 0;
        }
        if(!(t4_status & T4C3_STAT)){

            t4c3_cap = 0;
        }
        if(!(t4_status & T4C4_STAT)){

            t4c4_cap = 0;
        }

        t4_status = 0;
    }

    if((TIM_SR(TIM4) & TIM_SR_CC1IF)){

        //Falling edge detection
        if(TIM_CCER(TIM4) & TIM_CCER_CC1P){

            t4c1_cap = TIM_CCR1(TIM4) - t4c1_rise;

            //Set rising edge
            TIM_CCER(TIM4) &= ~TIM_CCER_CC1P;

            //Mark read instance
            t4_status |= T4C1_STAT;
        }
        //Rising edge detection
        else{

            //Get rise time
            t4c1_rise = TIM_CCR1(TIM4);     

            //Set falling edge
            TIM_CCER(TIM4) |= TIM_CCER_CC1P;

            //Mark read instance
            t4_status |= T4C1_STAT;
        }

    }
    if((TIM_SR(TIM4) & TIM_SR_CC2IF)){

        //Falling edge detection
        if(TIM_CCER(TIM4) & TIM_CCER_CC2P){


            //Record the time
            t4c2_cap = TIM_CCR2(TIM4) - t4c2_rise;

            //Set rising edge
            TIM_CCER(TIM4) &= ~TIM_CCER_CC2P;

            //Mark read instance
            t4_status |= T4C2_STAT;
        }
        //Rising edge detection
        else{

            t4c2_rise = TIM_CCR2(TIM4); 

            //Set falling edge
            TIM_CCER(TIM4) |= TIM_CCER_CC2P;

            //Mark read instance
            t4_status |= T4C2_STAT;

        }
    }
    if((TIM_SR(TIM4) &TIM_SR_CC3IF)){

        //Falling edge detection
        if(TIM_CCER(TIM4) & TIM_CCER_CC3P){


            //Record the time
            t4c3_cap = TIM_CCR3(TIM4) - t4c3_rise;

            //Set rising edge
            TIM_CCER(TIM4) &= ~TIM_CCER_CC3P;

            //Mark read instance
            t4_status |= T2C3_STAT;
        }
        //Rising edge detection
        else{

            t4c3_rise = TIM_CCR3(TIM4); 

            //Set falling edge
            TIM_CCER(TIM4) |= TIM_CCER_CC3P;

            //Mark read instance
            t4_status |= T4C3_STAT;

        }
    }
    if((TIM_SR(TIM4) & TIM_SR_CC4IF)){

        //Falling edge detection
        if(TIM_CCER(TIM4) & TIM_CCER_CC4P){

            //Record the time
            t4c4_cap = TIM_CCR4(TIM4) - t4c4_rise;

            //Set rising edge
            TIM_CCER(TIM4) &= ~TIM_CCER_CC4P;

            //Mark read instance
            t4_status |= T4C4_STAT;
        }
        //Rising edge detection
        else{

            t4c4_rise = TIM_CCR4(TIM4); 

            //Set falling edge
            TIM_CCER(TIM4) |= TIM_CCER_CC4P;

            //Mark read instance
            t4_status |= T4C4_STAT;

        }

    }
}

mcu_error TIMER_enableISR(timer_main timerNumber, void(*handler)(void)){

    mcu_error error;

    switch(timerNumber){

        case TIMER_1:

            nvic_disable_irq(NVIC_TIM1_UP_IRQ);
            timer_disable_irq(TIM1,TIM_DIER_UIE);
            tim1_up_handler = handler;
            timer_enable_irq(TIM1,TIM_DIER_UIE);
            nvic_enable_irq(NVIC_TIM1_UP_IRQ);
            break;

        case TIMER_2:

            nvic_disable_irq(NVIC_TIM2_IRQ);
            timer_disable_irq(TIM2,TIM_DIER_UIE);
            tim2_up_handler = handler;
            timer_enable_irq(TIM2,TIM_DIER_UIE);
            nvic_enable_irq(NVIC_TIM2_IRQ);
            break;

        case TIMER_3:

            nvic_disable_irq(NVIC_TIM3_IRQ);
            timer_disable_irq(TIM3,TIM_DIER_UIE);
            tim3_up_handler = handler;
            timer_enable_irq(TIM3,TIM_DIER_UIE);
            nvic_enable_irq(NVIC_TIM3_IRQ);
            break;

        case TIMER_4:

            nvic_disable_irq(NVIC_TIM4_IRQ);
            timer_disable_irq(TIM4,TIM_DIER_UIE);
            tim4_up_handler = handler;
            timer_enable_irq(TIM4,TIM_DIER_UIE);
            nvic_enable_irq(NVIC_TIM4_IRQ);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error = E_TIMER_NOTIMER;

            break;
    }

    return error;

}

mcu_error TIMER_disableISR(timer_main timerNumber){

    mcu_error error;

    switch(timerNumber){

        case TIMER_1:

            nvic_disable_irq(NVIC_TIM1_UP_IRQ);
            timer_disable_irq(TIM1,TIM_DIER_UIE);

            break;
        case TIMER_2:

            nvic_disable_irq(NVIC_TIM2_IRQ);
            timer_disable_irq(TIM2,TIM_DIER_UIE);
            break;
        case TIMER_3:

            nvic_disable_irq(NVIC_TIM3_IRQ);
            timer_disable_irq(TIM3,TIM_DIER_UIE);
            break;
        case TIMER_4:

