stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_timer.c
            //Set the clock
            rcc_periph_clock_enable(RCC_TIM3);

            //Setup main timer
            timer_disable_counter(TIM3);
            timer_reset(TIM3);
            timer_set_mode(TIM3, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_UP);
            TIMER_setFrequency(timerNumber, frequency);

            TIMER_enableISR(timerNumber,handler);

            timer_enable_counter(TIM3);
            break;

        case TIMER_4:

            //Set the clock
            rcc_periph_clock_enable(RCC_TIM4);

            //Setup main timer
            timer_disable_counter(TIM4);
            timer_reset(TIM4);
            timer_set_mode(TIM4, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_UP);
            TIMER_setFrequency(timerNumber, frequency);

            TIMER_enableISR(timerNumber,handler);

            timer_enable_counter(TIM4);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error = E_TIMER_NOTIMER;

            break;
    }

    return error;


}

static mcu_error timer1_setupIC(timer_channel timerChannel){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM1);

    //Setup main timer
    timer_disable_counter(TIM1);
    timer_set_mode(TIM1, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_UP);
    TIMER_setPeriod(TIMER_1,0xFFFF);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_IC,PORTA,PIN8);

            TIM_CCMR1(TIM1) |= TIM_CCMR1_CC1S_IN_TI1;
            TIM_CCER(TIM1) |= TIM_CCER_CC1E;

            //Set inital trigger as rising
            TIM_CCER(TIM1) &= ~TIM_CCER_CC1P;

            //Interrupts have different configuration for advanced timers
            nvic_disable_irq(NVIC_TIM1_CC_IRQ);
            timer_enable_irq(TIM1,TIM_DIER_CC1IE);
            tim1_cc_handler = timer1_input_capture;
            nvic_enable_irq(NVIC_TIM1_CC_IRQ);

            timer_enable_counter(TIM1);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_IC,PORTA,PIN9);

            TIM_CCMR1(TIM1) |= TIM_CCMR1_CC2S_IN_TI2;
            TIM_CCER(TIM1) |= TIM_CCER_CC2E;

            //Set inital trigger as rising
            TIM_CCER(TIM1) &= ~TIM_CCER_CC2P;

            //Interrupts have different configuration for advanced timers
            nvic_disable_irq(NVIC_TIM1_CC_IRQ);
            timer_enable_irq(TIM1,TIM_DIER_CC2IE);
            tim1_cc_handler = timer1_input_capture;
            nvic_enable_irq(NVIC_TIM1_CC_IRQ);

            timer_enable_counter(TIM1);
            break;

        case CHANNEL_3:

            pinSetup(GPIO_IC,PORTA,PIN10);

            TIM_CCMR2(TIM1) |= TIM_CCMR2_CC3S_IN_TI3;
            TIM_CCER(TIM1) |= TIM_CCER_CC3E;

            //Set inital trigger as rising
            TIM_CCER(TIM1) &= ~TIM_CCER_CC3P;

            //Interrupts have different configuration for advanced timers
            nvic_disable_irq(NVIC_TIM1_CC_IRQ);
            timer_enable_irq(TIM1,TIM_DIER_CC3IE);
            tim1_cc_handler = timer1_input_capture;
            nvic_enable_irq(NVIC_TIM1_CC_IRQ);

            timer_enable_counter(TIM1);

            break;
        case CHANNEL_4:

            pinSetup(GPIO_IC,PORTA,PIN11);

            TIM_CCMR2(TIM1) |= TIM_CCMR2_CC4S_IN_TI4;
            TIM_CCER(TIM1) |= TIM_CCER_CC4E;

            //Set inital trigger as rising
            TIM_CCER(TIM1) &= ~TIM_CCER_CC4P;

            //Interrupts have different configuration for advanced timers
            nvic_disable_irq(NVIC_TIM1_CC_IRQ);
            timer_enable_irq(TIM1,TIM_DIER_CC4IE);
            tim1_cc_handler = timer1_input_capture;
            nvic_enable_irq(NVIC_TIM1_CC_IRQ);

            timer_enable_counter(TIM1);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;
}

static mcu_error timer2_setupIC(timer_channel timerChannel){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM2);

    //Setup main timer
    timer_disable_counter(TIM2);
    timer_set_mode(TIM2, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_UP);
    TIMER_setPeriod(TIMER_2,0xFFFF);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_IC,PORTA,PIN0);

            TIM_CCMR1(TIM2) |= TIM_CCMR1_CC1S_IN_TI1;
            TIM_CCER(TIM2) |= TIM_CCER_CC1E;

            //Set inital trigger as rising
            TIM_CCER(TIM2) &= ~TIM_CCER_CC1P;

            timer_enable_irq(TIM2,TIM_DIER_CC1IE);

            timer_enable_counter(TIM2);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_IC,PORTA,PIN1);

            TIM_CCMR1(TIM2) |= TIM_CCMR1_CC2S_IN_TI2;
            TIM_CCER(TIM2) |= TIM_CCER_CC2E;

            //Set inital trigger as rising
            TIM_CCER(TIM2) &= ~TIM_CCER_CC2P;

            timer_enable_irq(TIM2,TIM_DIER_CC2IE);

            timer_enable_counter(TIM2);
            break;

        case CHANNEL_3:

            pinSetup(GPIO_IC,PORTA,PIN2);

            TIM_CCMR2(TIM2) |= TIM_CCMR2_CC3S_IN_TI3;
            TIM_CCER(TIM2) |= TIM_CCER_CC3E;

            //Set inital trigger as rising
            TIM_CCER(TIM2) &= ~TIM_CCER_CC3P;

            timer_enable_irq(TIM2,TIM_DIER_CC3IE);

            timer_enable_counter(TIM2);

            break;
        case CHANNEL_4:

            pinSetup(GPIO_IC,PORTA,PIN3);

            TIM_CCMR2(TIM2) |= TIM_CCMR2_CC4S_IN_TI4;
            TIM_CCER(TIM2) |= TIM_CCER_CC4E;

            //Set inital trigger as rising
            TIM_CCER(TIM2) &= ~TIM_CCER_CC4P;

            timer_enable_irq(TIM2,TIM_DIER_CC4IE);

            timer_enable_counter(TIM2);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;
}

static mcu_error timer3_setupIC(timer_channel timerChannel){

    mcu_error error;

