stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_timer.c
    //Set the clock
    rcc_periph_clock_enable(RCC_TIM3);

    //Setup main timer
    timer_disable_counter(TIM3);
    timer_set_mode(TIM3, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_UP);
    TIMER_setPeriod(TIMER_3,0xFFFF);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_IC,PORTA,PIN6);

            TIM_CCMR1(TIM3) |= TIM_CCMR1_CC1S_IN_TI1;
            TIM_CCER(TIM3) |= TIM_CCER_CC1E;

            //Set inital trigger as rising
            TIM_CCER(TIM3) &= ~TIM_CCER_CC1P;

            timer_enable_irq(TIM3,TIM_DIER_CC1IE);

            timer_enable_counter(TIM3);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_IC,PORTA,PIN7);

            TIM_CCMR1(TIM3) |= TIM_CCMR1_CC2S_IN_TI2;
            TIM_CCER(TIM3) |= TIM_CCER_CC2E;

            //Set inital trigger as rising
            TIM_CCER(TIM3) &= ~TIM_CCER_CC2P;

            timer_enable_irq(TIM3,TIM_DIER_CC2IE);

            timer_enable_counter(TIM3);
            break;

        case CHANNEL_3:

            pinSetup(GPIO_IC,PORTB,PIN0);

            TIM_CCMR2(TIM3) |= TIM_CCMR2_CC3S_IN_TI3;
            TIM_CCER(TIM3) |= TIM_CCER_CC3E;

            //Set inital trigger as rising
            TIM_CCER(TIM3) &= ~TIM_CCER_CC3P;

            timer_enable_irq(TIM3,TIM_DIER_CC3IE);

            timer_enable_counter(TIM3);

            break;
        case CHANNEL_4:

            pinSetup(GPIO_IC,PORTB,PIN1);

            TIM_CCMR2(TIM3) |= TIM_CCMR2_CC4S_IN_TI4;
            TIM_CCER(TIM3) |= TIM_CCER_CC4E;

            //Set inital trigger as rising
            TIM_CCER(TIM3) &= ~TIM_CCER_CC4P;

            timer_enable_irq(TIM3,TIM_DIER_CC4IE);

            timer_enable_counter(TIM3);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;
}

static mcu_error timer4_setupIC(timer_channel timerChannel){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM4);

    //Setup main timer
    timer_disable_counter(TIM4);
    timer_set_mode(TIM4, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_UP);
    TIMER_setPeriod(TIMER_4,0xFFFF);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_IC,PORTB,PIN6);

            TIM_CCMR1(TIM4) |= TIM_CCMR1_CC1S_IN_TI1;
            TIM_CCER(TIM4) |= TIM_CCER_CC1E;

            //Set inital trigger as rising
            TIM_CCER(TIM4) &= ~TIM_CCER_CC1P;

            timer_enable_irq(TIM4,TIM_DIER_CC1IE);

            timer_enable_counter(TIM4);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_IC,PORTB,PIN7);

            TIM_CCMR1(TIM4) |= TIM_CCMR1_CC2S_IN_TI2;
            TIM_CCER(TIM4) |= TIM_CCER_CC2E;

            //Set inital trigger as rising
            TIM_CCER(TIM4) &= ~TIM_CCER_CC2P;

            timer_enable_irq(TIM4,TIM_DIER_CC2IE);

            timer_enable_counter(TIM4);
            break;

        case CHANNEL_3:

            pinSetup(GPIO_IC,PORTB,PIN8);

            TIM_CCMR2(TIM4) |= TIM_CCMR2_CC3S_IN_TI3;
            TIM_CCER(TIM4) |= TIM_CCER_CC3E;

            //Set inital trigger as rising
            TIM_CCER(TIM4) &= ~TIM_CCER_CC3P;

            timer_enable_irq(TIM4,TIM_DIER_CC3IE);

            timer_enable_counter(TIM4);

            break;
        case CHANNEL_4:

            pinSetup(GPIO_IC,PORTB,PIN9);

            TIM_CCMR2(TIM4) |= TIM_CCMR2_CC4S_IN_TI4;
            TIM_CCER(TIM4) |= TIM_CCER_CC4E;

            //Set inital trigger as rising
            TIM_CCER(TIM4) &= ~TIM_CCER_CC4P;

            timer_enable_irq(TIM4,TIM_DIER_CC4IE);

            timer_enable_counter(TIM4);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;

}

uint16_t TIMER_getIC(timer_main timerNumber, timer_channel channel){

    switch(timerNumber){

        case TIMER_1:

            switch(channel){

                case CHANNEL_1:

                        return t1c1_cap;
                        break;

                case CHANNEL_2:

                        return t1c2_cap;
                        break;

                case CHANNEL_3:

                        return t1c3_cap;
                        break;
                      
                case CHANNEL_4:

                        return t1c4_cap;
                        break;
            }

            break;
        case TIMER_2:

            switch(channel){

                case CHANNEL_1:

                        return t2c1_cap;
                        break;

                case CHANNEL_2:

                        return t2c2_cap;
                        break;

                case CHANNEL_3:

                        return t2c3_cap;
                        break;
                      
                case CHANNEL_4:

                        return t2c4_cap;
                        break;
            }
            break;
        case TIMER_3:

            switch(channel){

                case CHANNEL_1:

                        return t3c1_cap;
                        break;

                case CHANNEL_2:

                        return t3c2_cap;
                        break;

                case CHANNEL_3:

                        return t3c3_cap;
                        break;
                      
                case CHANNEL_4:

                        return t3c4_cap;
                        break;
            }

            break;
        case TIMER_4:

            switch(channel){

                case CHANNEL_1:

                        return t4c1_cap;
                        break;

                case CHANNEL_2:

                        return t4c2_cap;
                        break;

                case CHANNEL_3:

                        return t4c3_cap;
                        break;
                      
