stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_timer.c
}

mcu_error timer4_setupPWM(timer_channel timerChannel, uint32_t frequency, uint8_t duty){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM4);

    //Setup main timer
    timer_disable_counter(TIM4);
    timer_set_mode(TIM4, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_DOWN);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_PWM,PORTB,PIN6);

            timer_set_oc_mode(TIM4, TIM_OC1, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM4, TIM_OC1);
            TIMER_setPeriod(TIMER_4,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_4,CHANNEL_1,duty);
            timer_enable_counter(TIM4);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_PWM,PORTB,PIN7);

            timer_set_oc_mode(TIM4, TIM_OC2, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM4, TIM_OC2);
            TIMER_setPeriod(TIMER_4,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_4,CHANNEL_2,duty);
            timer_enable_counter(TIM4);
            break;
            
        case CHANNEL_3:

            pinSetup(GPIO_PWM,PORTB,PIN8);

            timer_set_oc_mode(TIM4, TIM_OC3, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM4, TIM_OC3);
            TIMER_setPeriod(TIMER_4,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_4,CHANNEL_3,duty);
            timer_enable_counter(TIM4);
            break;

        case CHANNEL_4:

            pinSetup(GPIO_PWM,PORTB,PIN9);

            timer_set_oc_mode(TIM4, TIM_OC4, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM4, TIM_OC4);
            TIMER_setPeriod(TIMER_4,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setDuty(TIMER_4,CHANNEL_4,duty);
            timer_enable_counter(TIM4);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;

}

mcu_error timer1_setupPulse(timer_channel timerChannel,uint32_t frequency,uint32_t pulse){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM1);

    //Setup main timer
    timer_disable_counter(TIM1);
    timer_set_mode(TIM1, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_DOWN);
    timer_enable_break_main_output(TIM1);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_PWM,PORTA,PIN8);

            timer_set_oc_mode(TIM1, TIM_OC1, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM1, TIM_OC1);
            TIMER_setPeriod(TIMER_1,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_1,CHANNEL_1,pulse);
            timer_enable_counter(TIM1);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_PWM,PORTA,PIN9);

            timer_set_oc_mode(TIM1, TIM_OC2, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM1, TIM_OC2);
            TIMER_setPeriod(TIMER_1,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_1,CHANNEL_2,pulse);
            timer_enable_counter(TIM1);
            break;
        case CHANNEL_3:

            pinSetup(GPIO_PWM,PORTA,PIN10);

            timer_set_oc_mode(TIM1, TIM_OC3, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM1, TIM_OC3);
            TIMER_setPeriod(TIMER_1,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_1,CHANNEL_3,pulse);
            timer_enable_counter(TIM1);

            break;
        case CHANNEL_4:

            pinSetup(GPIO_PWM,PORTA,PIN11);

            timer_set_oc_mode(TIM1, TIM_OC4, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM1, TIM_OC4);
            TIMER_setPeriod(TIMER_1,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_1,CHANNEL_4,pulse);
            timer_enable_counter(TIM1);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;
}

mcu_error timer2_setupPulse(timer_channel timerChannel,uint32_t frequency,uint32_t pulse){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM2);

    //Setup main timer
    timer_disable_counter(TIM2);
    timer_set_mode(TIM2, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_DOWN);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_PWM,PORTA,PIN0);

            timer_set_oc_mode(TIM2, TIM_OC1, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM2, TIM_OC1);
            TIMER_setPeriod(TIMER_2,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_2,CHANNEL_1,pulse);
            timer_enable_counter(TIM2);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_PWM,PORTA,PIN1);

            timer_set_oc_mode(TIM2, TIM_OC2, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM2, TIM_OC2);
            TIMER_setPeriod(TIMER_2,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_2,CHANNEL_2,pulse);
            timer_enable_counter(TIM2);
            break;

        case CHANNEL_3:

            pinSetup(GPIO_PWM,PORTA,PIN2);

            timer_set_oc_mode(TIM2, TIM_OC3, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM2, TIM_OC3);
            TIMER_setPeriod(TIMER_2,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_2,CHANNEL_3,pulse);
            timer_enable_counter(TIM2);

            break;

        case CHANNEL_4:

            pinSetup(GPIO_PWM,PORTA,PIN3);

            timer_set_oc_mode(TIM2, TIM_OC4, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM2, TIM_OC4);
            TIMER_setPeriod(TIMER_2,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_2,CHANNEL_4,pulse);
            timer_enable_counter(TIM2);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;

