stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_timer.c
}

mcu_error timer3_setupPulse(timer_channel timerChannel,uint32_t frequency,uint32_t pulse){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM3);

    //Setup main timer
    timer_disable_counter(TIM3);
    timer_set_mode(TIM3, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_DOWN);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_PWM,PORTA,PIN6);

            timer_set_oc_mode(TIM3, TIM_OC1, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM3, TIM_OC1);
            TIMER_setPeriod(TIMER_3,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_3,CHANNEL_1,pulse);
            timer_enable_counter(TIM3);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_PWM,PORTA,PIN7);

            timer_set_oc_mode(TIM3, TIM_OC2, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM3, TIM_OC2);
            TIMER_setPeriod(TIMER_3,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_3,CHANNEL_2,pulse);
            timer_enable_counter(TIM3);
            break;

        case CHANNEL_3:

            pinSetup(GPIO_PWM,PORTB,PIN0);

            timer_set_oc_mode(TIM3, TIM_OC3, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM3, TIM_OC3);
            TIMER_setPeriod(TIMER_3,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_3,CHANNEL_3,pulse);
            timer_enable_counter(TIM3);

            break;

        case CHANNEL_4:

            pinSetup(GPIO_PWM,PORTB,PIN1);

            timer_set_oc_mode(TIM3, TIM_OC4, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM3, TIM_OC4);
            TIMER_setPeriod(TIMER_3,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_3,CHANNEL_4,pulse);
            timer_enable_counter(TIM3);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;

}

mcu_error timer4_setupPulse(timer_channel timerChannel,uint32_t frequency,uint32_t pulse){

    mcu_error error;

    //Set the clock
    rcc_periph_clock_enable(RCC_TIM4);

    //Setup main timer
    timer_disable_counter(TIM4);
    timer_set_mode(TIM4, TIM_CR1_CKD_CK_INT, TIM_CR1_CMS_EDGE,TIM_CR1_DIR_DOWN);

    switch(timerChannel){

        case CHANNEL_1:

            pinSetup(GPIO_PWM,PORTB,PIN6);

            timer_set_oc_mode(TIM4, TIM_OC1, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM4, TIM_OC1);
            TIMER_setPeriod(TIMER_4,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_4,CHANNEL_1,pulse);
            timer_enable_counter(TIM4);
            break;

        case CHANNEL_2:

            pinSetup(GPIO_PWM,PORTB,PIN7);

            timer_set_oc_mode(TIM4, TIM_OC2, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM4, TIM_OC2);
            TIMER_setPeriod(TIMER_4,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_4,CHANNEL_2,pulse);
            timer_enable_counter(TIM4);
            break;

        case CHANNEL_3:

            pinSetup(GPIO_PWM,PORTB,PIN8);

            timer_set_oc_mode(TIM4, TIM_OC3, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM4, TIM_OC3);
            TIMER_setPeriod(TIMER_4,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_4,CHANNEL_3,pulse);
            timer_enable_counter(TIM4);

            break;

        case CHANNEL_4:

            pinSetup(GPIO_PWM,PORTB,PIN9);

            timer_set_oc_mode(TIM4, TIM_OC4, TIM_OCM_PWM1);
            timer_enable_oc_output(TIM4, TIM_OC4);
            TIMER_setPeriod(TIMER_4,(uint32_t)(1000000.0f/(float)frequency));
            TIMER_setPulse(TIMER_4,CHANNEL_4,pulse);
            timer_enable_counter(TIM4);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOCHANNEL);
			}
            error = E_TIMER_NOCHANNEL;
            break;
    }

    return error;


}
/****************************************************************************/
//			                GET / SET COUNT
/****************************************************************************/

uint16_t TIMER_getCount(timer_main timerNumber){

    switch(timerNumber){

        case TIMER_1:

            return TIM_CNT(TIM1);
            break;
        case TIMER_2:

            return TIM_CNT(TIM2);
            break;

        case TIMER_3:

            return TIM_CNT(TIM3);
            break;

        case TIMER_4:

            return TIM_CNT(TIM4);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            return E_TIMER_NOTIMER;

            break;
    }

    return E_TIMER_NOERROR;

}
mcu_error TIMER_setCount(timer_main timerNumber, uint16_t count){

    switch(timerNumber){

        case TIMER_1:

            TIM_CNT(TIM1) = count;
            break;
        case TIMER_2:

            TIM_CNT(TIM2) = count;
            break;

        case TIMER_3:

            TIM_CNT(TIM3) = count;
            break;

        case TIMER_4:

            TIM_CNT(TIM4) = count;
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            return E_TIMER_NOTIMER;

            break;
    }

    return E_TIMER_NOERROR;


}
/****************************************************************************/
//			                PERIOD  / FREQUENCY
/****************************************************************************/
mcu_error TIMER_setPeriod(timer_main timerNumber, uint32_t period){

    uint32_t prescaler;

    switch(timerNumber){

        case TIMER_1:

            //Timer 1 runs on apb2, so at full clock speed, get the clock cycles per microsecond
            prescaler = (CLOCK_getSpeed()/1000000);

            if(period <= 0xFFFF){

                timer_set_prescaler(TIM1,prescaler-1);
                timer_set_period(TIM1, period-1);

            }
            else if(period <= 655350){

                prescaler *= 10;
                timer_set_prescaler(TIM1,prescaler-1);
                timer_set_period(TIM1, (period/10) - 1);
            }
            else if(period <= 6553500){

                prescaler *= 100;
                timer_set_prescaler(TIM1,prescaler-1);
                timer_set_period(TIM1, (period/100) -1);
            }
            else{

                //Too long
                if(MCU_debugIsEnabled()){
                    MCU_printError(E_TIMER_PERIOD);
                }
                return E_TIMER_PERIOD;
            }

            break;

        case TIMER_2:

            //Timer 2 runs on apb1, get the clock cycles per microsecond
            prescaler = (CLOCK_getSpeed()/1000000);

            if(period <= 0xFFFF){

                timer_set_prescaler(TIM2,prescaler-1);
                timer_set_period(TIM2, period-1);

