stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_timer.c
            }
            else if(period < 500000){

                prescaler *= 10;
                timer_set_prescaler(TIM2,prescaler-1);
                timer_set_period(TIM2, (period/10) - 1);
            }
            else if(period < 5000000){

                prescaler *= 100;
                timer_set_prescaler(TIM2,prescaler-1);
                timer_set_period(TIM2, (period/100) -1);
            }
            else{

                //Too long
                if(MCU_debugIsEnabled()){
                    MCU_printError(E_TIMER_PERIOD);
                }
                return E_TIMER_PERIOD;
            }
            break;

        case TIMER_3:

            //Timer 2 runs on apb1, get the clock cycles per microsecond
            prescaler = (CLOCK_getSpeed()/1000000);

            if(period <= 0xFFFF){

                timer_set_prescaler(TIM3,prescaler-1);
                timer_set_period(TIM3, period-1);

            }
            else if(period < 500000){

                prescaler *= 10;
                timer_set_prescaler(TIM3,prescaler-1);
                timer_set_period(TIM3, (period/10) - 1);
            }
            else if(period < 5000000){

                prescaler *= 100;
                timer_set_prescaler(TIM3,prescaler-1);
                timer_set_period(TIM3, (period/100) -1);
            }
            else{

                //Too long
                if(MCU_debugIsEnabled()){
                    MCU_printError(E_TIMER_PERIOD);
                }
                return E_TIMER_PERIOD;
            }
            break;

        case TIMER_4:

            prescaler = (CLOCK_getSpeed()/1000000);

            if(period <= 0xFFFF){

                timer_set_prescaler(TIM4,prescaler-1);
                timer_set_period(TIM4, period-1);

            }
            else if(period < 500000){

                prescaler *= 10;
                timer_set_prescaler(TIM4,prescaler-1);
                timer_set_period(TIM4, (period/10) - 1);
            }
            else if(period < 5000000){

                prescaler *= 100;
                timer_set_prescaler(TIM4,prescaler-1);
                timer_set_period(TIM4, (period/100) -1);
            }
            else{

                //Too long
                if(MCU_debugIsEnabled()){
                    MCU_printError(E_TIMER_PERIOD);
                }
                return E_TIMER_PERIOD;
            }
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            return E_TIMER_NOTIMER;

            break;
    }

    return E_TIMER_NOERROR;

}

mcu_error TIMER_setFrequency(timer_main timerNumber, uint32_t frequency){

    mcu_error error = E_TIMER_NOERROR;
    switch(timerNumber){

        case TIMER_1:

            error = TIMER_setPeriod(timerNumber,1000000.0f/(float)frequency);
            break;

        case TIMER_2:

            error = TIMER_setPeriod(timerNumber,1000000.0f/(float)frequency);
            break;

        case TIMER_3:

            error = TIMER_setPeriod(timerNumber,1000000.0f/(float)frequency);
            break;

        case TIMER_4:

            error = TIMER_setPeriod(timerNumber,1000000.0f/(float)frequency);
            break;

        default:
			if(MCU_debugIsEnabled()){
				MCU_printError(E_TIMER_NOTIMER);
			}
            error =  E_TIMER_NOTIMER;

            break;
    }

    return error;

}

mcu_error TIMER_setDuty(timer_main timerNumber, timer_channel channel,  uint8_t duty){

    if (duty > 100){

        duty = 100;
    }
    

    switch(timerNumber){

        case TIMER_1:

            switch(channel){

                case CHANNEL_1:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM1) &= ~TIM_CCER_CC1E;
                        }
                        else{
                            TIM_CCER(TIM1) |= TIM_CCER_CC1E;
                            timer_set_oc_value(TIM1, TIM_OC1, TIM_ARR(TIM1)*((float)(duty)/100.0f));

                        }
                            
                        break;

                case CHANNEL_2:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM1) &= ~TIM_CCER_CC2E;
                        }
                        else{
                            TIM_CCER(TIM1) |= TIM_CCER_CC2E;
                            timer_set_oc_value(TIM1, TIM_OC2, TIM_ARR(TIM1)*((float)(duty)/100.0f));

                        }
                        break;

                case CHANNEL_3:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM1) &= ~TIM_CCER_CC3E;
                        }
                        else{
                            TIM_CCER(TIM1) |= TIM_CCER_CC3E;
                            timer_set_oc_value(TIM1, TIM_OC3, TIM_ARR(TIM1)*((float)(duty)/100.0f));

                        }
                        break;
                      
                case CHANNEL_4:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM1) &= ~TIM_CCER_CC4E;
                        }
                        else{
                            TIM_CCER(TIM1) |= TIM_CCER_CC4E;
                            timer_set_oc_value(TIM1, TIM_OC4, TIM_ARR(TIM1)*((float)(duty)/100.0f));

                        }
                        break;
            }

            break;
        case TIMER_2:

            switch(channel){

                case CHANNEL_1:

                        //Timer doesn't completely disable with 0 duty cycle
                        if(duty == 0){

                            TIM_CCER(TIM2) &= ~TIM_CCER_CC1E;
                        }
                        else{
                            TIM_CCER(TIM2) |= TIM_CCER_CC1E;
                            timer_set_oc_value(TIM2, TIM_OC1, TIM_ARR(TIM2)*((float)(duty)/100.0f));

