stuianna/globLib/lib/stm32f1x3/lib/stm32f1x3_timer.c
                            }
                            TIM_CCER(TIM2) |= TIM_CCER_CC3E;
                            timer_set_oc_value(TIM2, TIM_OC3, pulse-1);
                        }
                        break;
                      
                case CHANNEL_4:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM2) &= ~TIM_CCER_CC4E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM2)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM2);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM2) |= TIM_CCER_CC4E;
                            timer_set_oc_value(TIM2, TIM_OC4, pulse-1);
                        }
                        break;
            }

            break;
        case TIMER_3:

            switch(channel){

                case CHANNEL_1:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM3) &= ~TIM_CCER_CC1E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM3)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM3);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM3) |= TIM_CCER_CC1E;
                            timer_set_oc_value(TIM3, TIM_OC1, pulse-1);
                        }

                        break;

                case CHANNEL_2:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM3) &= ~TIM_CCER_CC2E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM3)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM3);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM3) |= TIM_CCER_CC2E;
                            timer_set_oc_value(TIM3, TIM_OC2, pulse-1);
                        }
                        break;

                case CHANNEL_3:
                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM3) &= ~TIM_CCER_CC3E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM3)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM3);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM3) |= TIM_CCER_CC3E;
                            timer_set_oc_value(TIM3, TIM_OC3, pulse-1);
                        }
                        break;
                      
                case CHANNEL_4:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM3) &= ~TIM_CCER_CC4E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM3)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM3);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM3) |= TIM_CCER_CC4E;
                            timer_set_oc_value(TIM3, TIM_OC4, pulse-1);
                        }
                        break;
            }

            break;
        case TIMER_4:

            switch(channel){

                case CHANNEL_1:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM4) &= ~TIM_CCER_CC1E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM4)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM4);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
                            }
                            TIM_CCER(TIM4) |= TIM_CCER_CC1E;
                            timer_set_oc_value(TIM4, TIM_OC1, pulse-1);
                        }

                        break;

                case CHANNEL_2:

                        //Timer doesn't turn off completely at 0
                        if(pulse == 0){

                            TIM_CCER(TIM4) &= ~TIM_CCER_CC2E;
                            
                        }
                        else{

                            if(pulse > TIM_ARR(TIM4)){

                                error = E_TIMER_PULSE;
                                pulse = TIM_ARR(TIM4);

                                if(MCU_debugIsEnabled()){
                                    MCU_printError(E_TIMER_PULSE);
                                }
                                
